# setwd("//media//kswada//MyFiles//R//long_jump2")
setwd("//media//kswada//MyFiles//R//Bayesian_inference//long_jump2")

packages <- c("dplyr", "rstan")
purrr::walk(packages, library, character.only = TRUE, warn.conflicts = FALSE)



# ------------------------------------------------------------------------------
# data:  long jump2
# ------------------------------------------------------------------------------

N <- 20  

x <- c(775, 779, 799, 794, 770, 790, 775,  
     778, 808, 802, 776, 775, 799, 787,
     825, 785, 775, 762, 782, 788)


data <- list(N = N, x = x)



# ------------------------------------------------------------------------------
# Scan stan code
# ------------------------------------------------------------------------------

scr <- ".//stan//long_jump2.stan"

scan(scr, what = character(), sep = "\n", blank.lines.skip = F)



# ------------------------------------------------------------------------------
# Set parameters and Estimate
# ------------------------------------------------------------------------------

par<-c("quantile_3rd", "prob_over")

war <- 1000

ite <- 11000

see <- 1234

dig <- 3

cha <- 4



# ----------
fit <- stan(file = scr, data = data, pars = par, verbose = F, seed = see, chains = cha, warmup = war, iter = ite)



# ------------------------------------------------------------------------------
# plot traceplot
# ------------------------------------------------------------------------------

traceplot(fit, inc_warmup=F)



# ------------------------------------------------------------------------------
# plot posterior distribution
# ------------------------------------------------------------------------------

plot(fit)



# ----------
print(fit, pars = par, digits_summary = dig)



# ----------
# 具体的な目標値は(75%点)？:  797.016 (< 805)
# 練習記録が平均 8.05m, 標準偏差 0.1m　のとき、最終選考に残る確率は？:  77.1%
