setwd("//media//kswada//MyFiles//R//biological_clock//")

packages <- c("dplyr", "rstan")
purrr::walk(packages, library, character.only = TRUE, warn.conflicts = FALSE)



# ------------------------------------------------------------------------------
# data:  biological_clock
#   - 安静時（対照群）と運動後（実験群）で自分の体内時計がどのように変化をするかを調べるために、ストップウォッチを利用した実験を実施
#     スタートボタンを押した後、時計を見ずに30秒経ったと思った時点でストップボタンを押して、時間を計測
#     計測回数は各群20回
#     実験群の運動として、うさぎ跳びをして脈が速くなっている状況を設定し、データを取得した
#        - 安静時と運動後では体内時計に違いがあるか？
#        - 2つの群で簿平均が1秒以上差が開く確率は？
# ------------------------------------------------------------------------------
N1 <- 20
N2 <- 20

x1 <- c(30.86,29.75,31.55,32.29,29.90,31.71,31.35,29.03,30.37,31.55,
        29.26,32.29,29.90,30.18,30.72,32.28,30.72,29.90,31.55,31.55)

x2 <- c(31.36,33.34,33.16,31.36,36.19,29.80,31.11,35.23,31.36,31.27,
        31.63,31.63,32.00,31.11,31.63,31.36,31.81,31.63,29.21,33.37)

data <- list(N1 = N1, N2 = N2, x1 = x1, x2 = x2)



# ------------------------------------------------------------------------------
# Estimation by Hamilton Monte Carlo Method
# ------------------------------------------------------------------------------
scr <- ".//stan//biological_clock.stan"
scan(scr, what = character(), sep = "\n", blank.lines.skip = F)


par<-c("mu1", "mu2", "sigma1", "sigma2", "delta", "delta_over", "delta_over1")

war <- 1000               #バーンイン期間
ite <- 11000              #サンプル数
see <- 12345              #シード
dig <- 3                  #有効数字
cha <- 1                  #チェーンの数



# ----------
fit <- stan(file = scr, data = data, iter = ite, seed = see, warmup = war, pars = par, chains = cha)



# ----------
traceplot(fit, inc_warmup = F)

plot(fit)



# ----------
print(fit, pars = par, digits_summary = dig)



# ----------
# 安静時と運動後では体内時計に違いがあるか？:  YES
# 2つの群で簿平均が1秒以上差が開く確率は？:  62.7%


