setwd("//media//kswada//MyFiles//R//long_jump2")

packages <- c("dplyr", "rstan")
purrr::walk(packages, library, character.only = TRUE, warn.conflicts = FALSE)



# ------------------------------------------------------------------------------
# data:  long jump2
#   - 走り幅跳びのオリンピック代表を目指して日々練習に励んでいる
#     次の大会は代表選考会として重要なもので、大会上位25%の選手だけが、最終選考に残れる
#     具体的なボーダーラインを意識して練習に励みたい
#     前年度のこの大会の出場者20名の記録を取得
#        - 具体的な目標値は(75%点)？
#        - 練習記録が平均 8.05m, 標準偏差 0.1m　のとき、最終選考に残る確率は？
# ------------------------------------------------------------------------------

N <- 20

x <- c(775, 779, 799, 794, 770, 790, 775,  
     778, 808, 802, 776, 775, 799, 787,
     825, 785, 775, 762, 782, 788)


data <- list(N = N, x = x)



# ------------------------------------------------------------------------------
# basics
# ------------------------------------------------------------------------------
