setwd("//media//kswada//MyFiles//R//bearing//")

packages <- c("dplyr", "rstan")
purrr::walk(packages, library, character.only = TRUE, warn.conflicts = FALSE)



# ------------------------------------------------------------------------------
# data:  bearing
#   - 大手自動車メーカーの下請けとしてベアリングを製造
#     現在工場で使用している機器ではある時期を超えると内径にバラツキが出る
#     すでに10年利用しており検品を検討
#     これまでのベアリングの内径平均は145mm、分散は0.1	
#     検品用のベアリング40個の内径はデータの通り
#        - 検品用のベアリングの内径の分散が 0.1 を超える確率は？
#        - 納品先の基準である分散が 0.15 を超える確率が 80% のとき買い換える予定とすると、内径の分散が 0.15 を超える確率は？
# ------------------------------------------------------------------------------
N <- 40
x <- c(
  145.55, 145.41, 144.26, 145.05, 145.84, 145.06, 145.19, 145.30, 144.47,
  144.84, 145.18, 145.00, 144.95, 144.88, 145.25, 145.38, 145.28, 144.66,
  145.26, 144.47, 145.24, 144.29, 145.21, 144.77, 145.51, 144.33, 144.47,
  144.90, 144.76, 145.46, 145.04, 144.98, 145.41, 145.45, 144.83, 144.71,
  144.65, 144.21, 145.10, 145.10)

data <- list(N = N, x = x)



# ------------------------------------------------------------------------------
# Estimation by Hamilton Monte Carlo Method
# ------------------------------------------------------------------------------
scr <- ".//stan//bearing.stan"
scan(scr, what = character(), sep = "\n", blank.lines.skip = F)


par <- c("sigmasq", "sigmasq_over", "sigmasq_over2")

war <- 1000               #バーンイン期間
ite <- 11000              #サンプル数
see <- 12345              #シード
dig <- 3                  #有効数字
cha <- 1                  #チェーンの数



# ----------
fit <- stan(file = scr, data = data, iter = ite, seed = see, warmup = war, pars = par, chains = cha)



# ----------
traceplot(fit, inc_warmup = F)

plot(fit)



# ----------
print(fit, pars = par, digits_summary = dig)



# ----------
# 検品用のベアリングの内径の分散が 0.1 を超える確率は？: 98.9%
# 納品先の基準である分散が 0.15 を超える確率が 80% のとき買い換える予定とすると、内径の分散が 0.15 を超える確率は？:  62.1%


